Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd
d=[4, 8, 15, 16, 23, 4]
df=pd.DataFrame(d)

In [2]:
df

    0
0   4
1   8
2  15
3  16
4  23
5   4

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [3]:
d2=[1,2,3,4,5,6,7,8,9,10,11]
df2=pd.DataFrame(d2)
df2

     0
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9   10
10  11

Q3. Create a Pandas DataFrame that contains the following data:

In [4]:
data = {'Name': ['Alice', 'Bob', 'Claire',],

        'Age': [25, 30, 27,],

        'Occupation': ['Female', 'male', 'Female']}
df4=pd.DataFrame(data)
df4

     Name  Age Occupation
0   Alice   25     Female
1     Bob   30       male
2  Claire   27     Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.


Ans:Pandas DataFrame is a two-dimensional structure with columns and rows whose size can be changed.

Series is 1D while pandas is 2D.

Series elements should be of same data type while for dataframe they can be different.

Series is Immutable while Dataframes are mutable

In [5]:
#Series 
data = {'Mon': 22, 'Tues': 23, 'Wed': 23, 'Thurs': 24, 'Fri': 23, 'Sat': 22, 'Sun': 21}
series = pd.Series(data=data, name='series_from_dict')
print(series)

Mon      22
Tues     23
Wed      23
Thurs    24
Fri      23
Sat      22
Sun      21
Name: series_from_dict, dtype: int64

In [6]:
data = {'Name': ['John', 'Jane', 'Jim', 'Joan'],

        'Age': [25, 30, 35, 40],

        'Occupation': ['Engineer', 'Doctor', 'Teacher', 'Lawyer']}
df = pd.DataFrame(data)
df

   Name  Age Occupation
0  John   25   Engineer
1  Jane   30     Doctor
2   Jim   35    Teacher
3  Joan   40     Lawyer

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [21]:
df=pd.read_csv('stock_data.csv',na_values={
    'eps':['not available','n.a.'],
    'revenue':['not available','n.a.',-1],
    'people':['not available','n.a.']

}) 
df

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [22]:
#drop rows with na values
df.dropna()

  tickers    eps  revenue price      people
0   GOOGL  27.82     87.0   845  larry page
2    MSFT  -1.00     85.0    64  bill gates

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   tickers  5 non-null      object
 1   eps      4 non-null      float64
 2   revenue  4 non-null      float64
 3   price    5 non-null      object
 4   people   4 non-null      object
dtypes: float64(2), object(3)
memory usage: 328.0+ bytes

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans:Series

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [31]:
courses = pd.Series(["Spark","PySpark","Hadoop"])
fees = pd.Series([22000,25000,23000])
discount  = pd.Series([1000,2300,1000])

ser={'course_frame':courses,'fees_frame':fees,'discount_frame':discount}
df=pd.DataFrame(ser)

In [32]:
df

  course_frame  fees_frame  discount_frame
0        Spark       22000            1000
1      PySpark       25000            2300
2       Hadoop       23000            1000